In [1]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split

import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
df = pd.read_csv('main.csv',usecols=['Age','Fare','Survived'])

In [17]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [18]:
df.isnull().mean() * 100

Survived     0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [19]:
X = df.drop(columns=['Survived'])
y = df['Survived']

In [20]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [21]:
X_train

      Age      Fare
30   40.0   27.7208
10    4.0   16.7000
873  47.0    9.0000
182   9.0   31.3875
876  20.0    9.8458
..    ...       ...
534  30.0    8.6625
584   NaN    8.7125
493  71.0   49.5042
527   NaN  221.7792
168   NaN   25.9250

[712 rows x 2 columns]

In [22]:
X_train['Age_imputed'] = X_train['Age']
X_test['Age_imputed'] = X_test['Age']

In [23]:
X_train.head()

      Age     Fare  Age_imputed
30   40.0  27.7208         40.0
10    4.0  16.7000          4.0
873  47.0   9.0000         47.0
182   9.0  31.3875          9.0
876  20.0   9.8458         20.0

In [24]:
X_test.tail()

      Age     Fare  Age_imputed
89   24.0   8.0500         24.0
80   22.0   9.0000         22.0
846   NaN  69.5500          NaN
870  26.0   7.8958         26.0
251  29.0  10.4625         29.0

In [25]:
X_train['Age_imputed'].isnull()

30     False
10     False
873    False
182    False
876    False
       ...
534    False
584     True
493    False
527     True
168     True
Name: Age_imputed, Length: 712, dtype: bool

In [43]:
n_missing = X_train['Age_imputed'].isnull().sum()
random_sample = X_train['Age'].dropna().sample(n_missing, random_state=42).values
X_train.loc[X_train['Age_imputed'].isnull(), 'Age_imputed'] = random_sample

n_missing1 = X_test['Age_imputed'].isnull().sum()
random_sample1 = X_test['Age'].dropna().sample(n_missing1, random_state=42).values
X_test.loc[X_test['Age_imputed'].isnull(), 'Age_imputed'] = random_sample1

In [33]:
X_train['Age'].dropna().values

array([40.  ,  4.  , 47.  ,  9.  , 20.  , 30.  , 30.  , 13.  , 36.  ,
       31.  , 38.  , 18.  , 25.  , 37.  , 18.  , 35.  , 46.  , 70.5 ,
       48.  , 48.  , 24.  , 56.  , 54.  , 16.  , 34.  , 43.  ,  2.  ,
       50.  , 60.  , 41.  ,  3.  , 39.  , 33.  , 37.  , 42.  , 19.  ,
       16.  , 24.  , 45.  , 29.  , 35.  , 30.  , 17.  , 14.5 , 27.  ,
       57.  , 42.  , 19.  , 31.  , 30.  , 30.  , 59.  , 24.  , 39.  ,
       23.  , 27.  , 35.  , 23.  , 21.  , 26.  , 24.  , 36.  , 31.  ,
       20.  ,  7.  , 30.  , 30.  , 43.  , 45.  , 38.  , 24.  , 19.  ,
       30.  , 31.  , 44.  , 31.  , 24.  , 19.  , 35.  , 21.  , 48.  ,
       41.  , 26.  , 18.  , 34.  , 30.  , 40.  , 21.  , 30.  , 30.  ,
       25.  ,  5.  , 35.  ,  2.  , 24.  , 21.  , 22.  , 31.  ,  4.  ,
       19.  , 39.  , 32.  , 36.  , 45.5 , 28.  , 16.  , 42.  , 50.  ,
       32.  , 36.  , 35.  , 36.  , 33.  , 36.  , 28.  , 65.  , 27.  ,
       47.  , 31.  , 32.  , 30.  , 20.  , 22.  , 41.  , 32.  , 28.5 ,
       33.  , 20.  , 22.  , 40.5 , 21.  , 24.  ,  3.  , 39.  , 27.  ,
        4.  , 39.  , 60.  , 58.  , 36.  , 45.  , 32.5 , 20.  , 40.  ,
        4.  , 36.  , 29.  , 34.  , 45.  , 31.  , 49.  , 11.  , 25.  ,
       25.  , 51.  , 49.  , 24.  , 30.  , 22.  , 39.  , 45.  ,  9.  ,
       32.  , 39.  , 32.  ,  2.  , 20.  , 43.  , 26.  , 29.  , 34.  ,
       16.  , 18.  , 54.  ,  1.  , 29.  , 44.  , 19.  , 28.  , 42.  ,
       17.  , 47.  , 20.  , 29.  , 30.  , 49.  , 27.  , 32.  , 27.  ,
       16.  , 33.  , 25.  ,  2.  , 23.  , 36.  , 30.  , 33.  , 45.  ,
       23.  , 47.  , 30.  , 22.  , 32.  ,  0.75, 16.  , 52.  , 33.  ,
       24.  , 29.  , 45.  , 25.  , 38.  , 34.5 ,  8.  , 24.  , 24.  ,
       28.  , 19.  , 51.  , 27.  , 40.  , 59.  ,  9.  , 42.  , 14.  ,
        1.  , 28.  , 58.  , 15.  , 34.  , 36.  , 28.  , 21.  , 28.  ,
       38.  , 20.  , 31.  , 27.  , 29.  , 23.  , 51.  , 40.  , 53.  ,
        1.  , 51.  , 25.  , 29.  , 32.  , 26.  , 15.  , 25.  , 24.  ,
       48.  , 24.  , 32.  , 17.  , 25.  ,  9.  ,  2.  , 50.  , 54.  ,
       26.  , 14.  , 22.  , 27.  , 24.  ,  0.83,  2.  , 19.  , 65.  ,
       56.  , 16.  , 35.  , 24.  , 18.  , 37.  , 21.  , 34.  , 45.5 ,
        2.  , 24.  , 22.  , 42.  , 33.  , 24.  , 32.  , 32.  , 33.  ,
       17.  , 21.  , 24.  , 20.  , 28.  , 48.  , 19.  , 22.  , 14.  ,
       25.  , 42.  , 25.  ,  9.  , 35.  , 19.  ,  8.  , 31.  , 43.  ,
       24.  ,  4.  , 19.  , 22.  , 18.  , 22.  ,  9.  , 17.  , 21.  ,
       52.  , 31.  , 21.  , 23.  , 44.  , 17.  ,  5.  , 26.  , 50.  ,
       22.  , 46.  , 61.  , 41.  , 62.  , 24.  , 35.  , 35.  , 26.  ,
       31.  , 23.  , 34.  , 54.  , 19.  , 27.  , 30.5 , 23.  , 49.  ,
       28.  , 39.  , 36.  , 38.  , 18.  , 19.  , 58.  , 37.  ,  0.75,
       24.  , 18.  , 28.5 , 66.  ,  8.  , 10.  , 16.  , 47.  , 45.  ,
       22.  , 44.  , 46.  , 24.  , 41.  , 33.  , 32.  , 14.  , 17.  ,
       21.  ,  9.  , 34.  , 37.  , 43.  ,  5.  , 28.  , 24.  , 30.  ,
       21.  , 29.  , 16.  , 47.  , 14.  , 31.  , 36.  , 52.  , 36.  ,
       54.  , 45.  , 40.5 , 27.  , 19.  , 61.  , 36.  , 16.  , 42.  ,
       38.  , 29.  ,  3.  ,  7.  , 30.  , 27.  , 21.  , 25.  , 16.  ,
       42.  , 62.  ,  4.  , 26.  , 45.  , 30.  , 42.  , 14.  , 11.  ,
       27.  , 33.  , 26.  , 28.  , 21.  , 32.  , 32.5 ,  4.  , 16.  ,
       29.  , 29.  , 23.  , 18.  , 18.  , 18.  , 27.  , 26.  , 27.  ,
       23.  ,  3.  , 26.  ,  4.  , 25.  , 34.  , 50.  , 34.  ,  0.67,
       22.  , 35.  , 21.  , 23.5 , 18.  , 58.  , 38.  , 30.  , 56.  ,
       56.  , 28.  , 20.  , 28.  ,  4.  , 35.  , 44.  , 25.  , 16.  ,
       22.  , 22.  , 20.  , 15.  , 45.  , 51.  , 36.5 ,  6.  , 34.  ,
       40.  , 24.  , 11.  , 52.  , 61.  , 18.  ,  6.  , 29.  ,  3.  ,
       40.  , 28.  , 39.  , 48.  , 63.  , 32.  , 36.  , 39.  , 52.  ,
       40.  , 12.  ,  0.42, 38.  , 29.  , 18.  , 25.  , 21.  ,  9.  ,
       16.  , 34.  , 23.  , 24.  , 28.  , 39.  , 16.  , 22.  , 25.  ,
       34.  , 62.  , 71.  , 28.  , 13.  , 22.  , 16.  , 60.  , 18.  ,
       23.  , 26.  , 33.  , 28.  , 18.  , 70.  , 25.  , 33.  , 50.  ,
       18.  , 40.  , 26.  , 40.  , 33.  , 47.  ,  7.  , 19.  , 47.  ,
       36.  , 35.  , 19.  , 22.  , 23.  , 36.  , 22.  , 29.  , 62.  ,
       64.  , 17.  , 21.  , 57.  , 21.  , 58.  , 36.  , 31.  , 26.  ,
       54.  , 20.  , 29.  , 22.  ,  0.83, 20.  , 60.  , 27.  , 17.  ,
       40.  , 40.  , 25.  , 50.  , 30.  , 71.  ])

In [41]:
X_train.loc[X_train['Age_imputed'].isnull(), 'Age_imputed']

Series([], Name: Age_imputed, dtype: float64)

In [44]:
X_train

      Age      Fare  Age_imputed
30   40.0   27.7208         40.0
10    4.0   16.7000          4.0
873  47.0    9.0000         47.0
182   9.0   31.3875          9.0
876  20.0    9.8458         20.0
..    ...       ...          ...
534  30.0    8.6625         30.0
584   NaN    8.7125         45.0
493  71.0   49.5042         71.0
527   NaN  221.7792         30.0
168   NaN   25.9250         18.0

[712 rows x 3 columns]

In [45]:
print('Original variable variance: ', X_train['Age'].var())
print('Variance after random imputation: ', X_train['Age_imputed'].var())

Original variable variance:  204.3495133904614
Variance after random imputation:  206.3193433301334

In [46]:
X_train[['Fare', 'Age', 'Age_imputed']].cov()

                    Fare         Age  Age_imputed
Fare         2368.246832   71.512440    50.834578
Age            71.512440  204.349513   204.349513
Age_imputed    50.834578  204.349513   206.319343